package com.xeg.cores.base.im.enumerate;

/**
 * @author 宁鹏
 * 消息Code枚举
 */
public enum MsgCodeEnum {

    MSG_1000(1000, "十人状态"),
    MSG_1001(1001, "主持人完善订单"),
    MSG_1002(1002, "转移订单推送给排队工人"),
    MSG_1003(1003, "转移订单推送给报价工人"),
    MSG_1004(1004, "雇主上麦邀请"),
    MSG_1005(1005, "雇工被踢下麦"),
    MSG_1006(1006, "雇工被选择"),
    MSG_1007(1007, "完成招工"),
    MSG_1008(1008, "雇主下麦"),
    MSG_1009(1009, "订单即将开始"),
    MSG_1010(1010, "转移订单"),
    MSG_1011(1011, "雇工排队成功"),
    MSG_1012(1012, "雇工上麦"),
    MSG_1013(1013, "清屏"),
    MSG_1014(1014, "雇主确认订单(所有人)"),
    MSG_1015(1015, "雇主确认订单(排队工人)"),
    MSG_1016(1016, "雇工被拒绝"),
    MSG_1017(1017, "邀请雇工上麦"),
    MSG_1018(1018, "麦上订单雇工排队变化推送"),
    MSG_1019(1019, "雇主排队变化推送"),
    MSG_1020(1020, "私聊"),
    MSG_1021(1021, "雇主上麦邀请to主持人"),
    MSG_1022(1022, "雇主上麦to主持人"),
    MSG_1023(1023, "报价自荐"),
    MSG_1024(1024, "踢出房间"),
    MSG_1026(1026, "雇工上麦成功"),
    MSG_1027(1027, "雇主收到排队工人+1"),
    MSG_1028(1028, "雇主排队成功"),
    MSG_1029(1029, "雇主上麦"),
    MSG_1030(1030, "雇工处理邀请上麦结果回执"),
    MSG_1031(1031, "切换流程"),
    MSG_1032(1032, "雇工上麦倒计时结束To雇工"),
    MSG_1033(1033, "成单工人变化"),
    MSG_1034(1034, "雇主取消订单"),
    MSG_1035(1035, "雇主确认订单(主持人)"),
    MSG_1036(1036, "直播间开播通知所有人"),
    MSG_2005(2005, "禁言"),
    MSG_2006(2006, "开放聊天"),
    MSG_2007(2007, "禁止聊天"),
    MSG_2008(2008, "设置管理员"),
    MSG_2009(2009, "移除管理员"),
    MSG_2010(2010, "雇主上麦"),
    MSG_2011(2011, "雇主下麦"),
    MSG_2012(2012, "切下一组"),
    MSG_2013(2013, "全员发言"),
    MSG_2014(2014, "补位"),
    MSG_2015(2015, "替你主持"),
    MSG_2016(2016, "拒绝替你支持"),
    MSG_2017(2017, "同意替你主持"),
    MSG_2018(2018, "统一报价"),
    MSG_2019(2019, "超时提醒"),
    MSG_2020(2020, "开始顺序发言"),
    MSG_2021(2021, "结束顺序发言"),
    MSG_2022(2022, "提醒报价"),
    MSG_2023(2023, "切下一组-主持人"),
    MSG_2024(2024, "全员禁言"),
    MSG_2025(2025, "解除禁言"),
    ;

    public final int code;
    public final String value;

    private MsgCodeEnum(int code, String value) {
        this.value = value;
        this.code = code;
    }
}
